print("Індивідуальне завдання 10")
print("Тема. Робота з конструкціями розгалудження та математичними функціями.")
print("Мета. Отримати практичні навички в роботі з конструкціями розгалудження "
      "в поєднані з математичними функціями.")
V = variant = int(input("Варіант № "))

from math import *

x = float(input("\nВведіть значення аргументу для функції: "))

if x <= -2:
    f = sqrt(3 * V - x)/(V - 3 * x)
elif -2 < x < 0:
    f = cos(x + V) / x**(1+V)
elif 0 <= x <= 3:
    f = (x**2/V) - tan(V**x)
elif x > 3:
    f = sin(x)/(V + log(x))
    
print("f (%s) = %s" % (x, round(f, 2)))